export default [
  {
    label: 'Mission 1',
    answers: [
      'A',
    ],
    hints: [
      '誰是壞人？',
      'B：「我不是平民」',
      'C：「我不是好人」',
      '好人只會說實話，壞人只會說謊',
      'A：「我不是壞人」',
    ],
  },
  {
    label: 'Mission 2',
    answers: [
      'D',
    ],
    hints: [
      'C：「我和 D 都是清白的。」',
      'D：「不是 B 洩漏的。」',
      'E：「C 沒有說實話。」',
      '有一個人說謊，還有一個人洩漏了機密',
      '誰洩漏了機密？',
      'A：「不是我，也不是 C。」',
      'B：「A 沒有洩漏資料。」',
    ],
  },
  {
    label: 'Mission 3',
    answers: [
      'CBA',
    ],
    hints: [
      'B：「C 不是最後」',
      'C：「A 不是最後」',
      '有三個人排隊',
      'A：「B 在我前面」',
      '三個人排序是什麼？',
    ],
  },
  {
    label: 'Mission 4',
    answers: [
      '8',
    ],
    hints: [
      '某研討會上，有誠實國跟說謊國的學者們參加',
      '所有人圍坐在一圓桌旁',
      '主席說：『會議開始吧！這次總共有 9 個人參加。』',
      '但坐在主席左邊的人卻在會議記錄簿寫下總共有 8 個人參加',
      '每個人都說坐在自己右邊的是說謊國的人',
      '這個會議到底有多少人參加？',
    ],
  },
  {
    label: 'Mission 5',
    answers: [
      'ACDFBE',
    ],
    hints: [
      'A、B、C、D、E、F六個人圍著圓桌坐下',
      'B 是坐在 A 右邊的第二人',
      'E 和 F 兩人不相鄰',
      'E 坐在 D 的正對面',
      'F 是坐 C 在左邊的第二人',
      '從A開始順時鐘算起，他們六個人是怎麼坐的呢？',
    ],
  },
  {
    label: 'Mission 6',
    answers: [
      '5',
    ],
    hints: [
      '媽媽剛烤好放在桌上的餅乾被吃光了',
      '老大說：『是老四吃的。』',
      '老二說：『我沒有吃。』',
      '老三說：『不是老五吃的。』',
      '老四說：『大哥說謊。』',
      '老五說：『二哥說的是實話。』',
      '只有一個人吃了餅乾',
      '且五兄弟裡只有三個人說了實話',
      '誰吃了餅乾？',
    ],
  },
]
